Revit 2026 API

# SpaceDesignSupplyAirflow Property

---

Get or set the Specified Supply Airflow of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double DesignSupplyAirflow { get; set; }
```
```vb
Public Property DesignSupplyAirflow As Double
	Get
	Set
```
```cpp
public:
property double DesignSupplyAirflow {
	double get ();
	void set (double value);
}
```
```fsharp
member DesignSupplyAirflow : float with get, set
```

#### Property Value

Double

This property is used to get or set the Specified Supply Airflow (Unit: CFM) of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace